In [3]:
%matplotlib inline
import pandas as pd

In [4]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [5]:
titles.dtypes

title    object
year      int64
dtype: object

### How many movies are listed in the titles dataframe?

In [6]:
len(titles['title'].unique())

223828

### What are the earliest two films listed in the titles dataframe?

In [7]:
titles.sort_values(by='year')[0:2]

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [8]:
len(titles[titles['title']=='Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [9]:
len(titles[titles['title']=='North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [10]:
list(titles[titles['title']=='Hamlet'].sort_values(by='year')['year'][0:1])[0]

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [11]:
titles[titles['title']=='Treasure Island'].sort_values(by='year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [12]:
len(titles[titles['year']==1950])

1113

### How many movies were made in the year 1960?

In [13]:
len(titles[titles['year']==1960])

1549

### How many movies were made from 1950 through 1959?

In [14]:
len(titles[(titles['year']>1950) & (titles['year']<1960)] )

11821

### In what years has a movie titled "Batman" been released?

In [15]:
len(titles[titles['title']=='Batman'])

2

### How many roles were there in the movie "Inception"?

In [16]:
!cat cast.csv | head

title,year,name,type,character,n
Closet Monster,2015,Buffy #1,actor,Buffy 4,31
Suuri illusioni,1985,Homo $,actor,Guests,22
Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10
Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,
Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,
Straight Outta Compton,2015,$hutter,actor,Club Patron,
Straight Outta Compton,2015,$hutter,actor,Dopeman,
For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,
"Lapis, Ballpen at Diploma, a True to Life Journey",2014,Jori ' Danilo' Jurado Jr.,actor,Jaime (young),9

In [17]:
df_cast = pd.read_csv('cast.csv',error_bad_lines=False)

b'Skipping line 18247: expected 6 fields, saw 8\nSkipping line 36436: expected 6 fields, saw 7\nSkipping line 109121: expected 6 fields, saw 10\n'
b'Skipping line 144785: expected 6 fields, saw 8\nSkipping line 180506: expected 6 fields, saw 8\nSkipping line 216780: expected 6 fields, saw 8\n'
b'Skipping line 270699: expected 6 fields, saw 11\nSkipping line 306546: expected 6 fields, saw 10\nSkipping line 324462: expected 6 fields, saw 8\nSkipping line 342362: expected 6 fields, saw 7\nSkipping line 360147: expected 6 fields, saw 7\nSkipping line 378078: expected 6 fields, saw 8\n'
b'Skipping line 414079: expected 6 fields, saw 7\nSkipping line 431968: expected 6 fields, saw 9\nSkipping line 467875: expected 6 fields, saw 7\nSkipping line 485853: expected 6 fields, saw 8\n'
b'Skipping line 575620: expected 6 fields, saw 8\nSkipping line 611791: expected 6 fields, saw 9\nSkipping line 647749: expected 6 fields, saw 8\n'
b'Skipping line 683545: expected 6 fields, saw 8\nSkipping line 718932: expected 6 fields, saw 8\nSkipping line 754559: expected 6 fields, saw 8\nSkipping line 772346: expected 6 fields, saw 8\n'
b'Skipping line 808477: expected 6 fields, saw 10\nSkipping line 844391: expected 6 fields, saw 9\n'
b'Skipping line 934420: expected 6 fields, saw 8\nSkipping line 970603: expected 6 fields, saw 8\nSkipping line 988653: expected 6 fields, saw 8\n'
b'Skipping line 1096250: expected 6 fields, saw 8\nSkipping line 1132239: expected 6 fields, saw 8\n'
b'Skipping line 1223066: expected 6 fields, saw 10\nSkipping line 1277674: expected 6 fields, saw 11\n'
b'Skipping line 1350089: expected 6 fields, saw 10\nSkipping line 1421816: expected 6 fields, saw 7\n'
b'Skipping line 1457859: expected 6 fields, saw 10\nSkipping line 1512279: expected 6 fields, saw 10\nSkipping line 1565763: expected 6 fields, saw 7\n'
b'Skipping line 1583760: expected 6 fields, saw 10\nSkipping line 1673084: expected 6 fields, saw 10\n'
b'Skipping line 1708854: expected 6 fields, saw 8\nSkipping line 1744601: expected 6 fields, saw 9\nSkipping line 1798490: expected 6 fields, saw 10\n'
b'Skipping line 1852364: expected 6 fields, saw 10\nSkipping line 1888297: expected 6 fields, saw 7\nSkipping line 1942081: expected 6 fields, saw 8\n'
b'Skipping line 2086334: expected 6 fields, saw 8\n'
b'Skipping line 2122287: expected 6 fields, saw 9\nSkipping line 2140452: expected 6 fields, saw 7\nSkipping line 2212965: expected 6 fields, saw 8\n'
b'Skipping line 2302890: expected 6 fields, saw 8\nSkipping line 2338776: expected 6 fields, saw 7\n'
b'Skipping line 2393183: expected 6 fields, saw 8\nSkipping line 2411374: expected 6 fields, saw 8\nSkipping line 2447497: expected 6 fields, saw 8\nSkipping line 2465568: expected 6 fields, saw 8\n'
/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (1) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [18]:
df_cast.tail()

                                    title  year  ...               character     n
4416692                           Foxtrot  1988  ...                    D?ra  24.0
4416693  Niceland (Population. 1.000.002)  2004  ...            Woman in Bus  26.0
4416694                         Skammdegi  1985  ...           Hj?krunarkona   9.0
4416695                      U.S.S.S.S...  2003  ...  Afgr.dama ? bens?nst??  17.0
4416696                 Bye Bye Blue Bird  1999  ...       Pensionatv?rtinde   NaN

[5 rows x 6 columns]

In [19]:
df_cast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4416697 entries, 0 to 4416696
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       object
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), object(5)
memory usage: 202.2+ MB

In [20]:
len(df_cast[df_cast['title'] == 'Inception']['character'].unique())

56

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [21]:
import numpy as np

In [22]:
len(df_cast[(df_cast['title'] == 'Inception') & (df_cast['n'].isnull()) ]['character'].unique())

21

### But how many roles in the movie "Inception" did receive an "n" value?

In [23]:
len(df_cast[(df_cast['title'] == 'Inception') & (df_cast['n'].notna()) ]['character'].unique())

36

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [24]:
df_cast[df_cast['title'] == 'North by Northwest'].dropna().sort_values(by='n')

                      title  year  ...                    character     n
1735990  North by Northwest  1959  ...           Roger O. Thornhill   1.0
495231   North by Northwest  1959  ...           Roger O. Thornhill   1.0
4148854  North by Northwest  1959  ...                  Eve Kendall   2.0
1654247  North by Northwest  1959  ...              Phillip Vandamm   3.0
3787753  North by Northwest  1959  ...              Clara Thornhill   4.0
697785   North by Northwest  1959  ...                The Professor   5.0
3678793  North by Northwest  1959  ...                Mrs. Townsend   6.0
2144185  North by Northwest  1959  ...              Lester Townsend   7.0
1293237  North by Northwest  1959  ...                      Leonard   8.0
3077602  North by Northwest  1959  ...                     Valerian   9.0
2369063  North by Northwest  1959  ...              Victor Larrabee  10.0
1332527  North by Northwest  1959  ...                        Licht  11.0
91589    North by Northwest  1959  ...                        Licht  11.0
2926235  North by Northwest  1959  ...                   Auctioneer  12.0
913812   North by Northwest  1959  ...                    Dr. Cross  13.0
1759155  North by Northwest  1959  ...               Sergeant Flamm  14.0
403789   North by Northwest  1959  ...               Captain Junket  15.0
1510408  North by Northwest  1959  ...  Charley - Chicago Policeman  16.0

[18 rows x 6 columns]

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [25]:
df_cast[(df_cast['year'] == 1972) & (df_cast['title'] == 'Sleuth')].sort_values(by='n')

          title  year                name     type        character    n
3355074  Sleuth  1972  Eve (III) Channing  actress  Marguerite Wyke  5.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [26]:
df_cast[(df_cast['year'] == 2007) & (df_cast['title'] == 'Sleuth')].sort_values(by='n')

          title  year               name     type        character   n
3355073  Sleuth  2007  Eve (II) Channing  actress  Marguerite Wyke NaN
4000945  Sleuth  2007  Carmel O'Sullivan  actress           Maggie NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [27]:
df_cast[(df_cast['year'] == 1921) & (df_cast['title'] == 'Hamlet')]

          title  year                    name     type         character    n
2816079  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
3006514  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
3294944  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3692544  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3985697  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

#### What do you mean by silent ?

### How many roles were credited in Branagh’s 1996 Hamlet?

In [28]:
len(df_cast[(df_cast['year'] == 1996) & (df_cast['title'] == 'Hamlet')])

26

### How many "Hamlet" roles have been listed in all film credits through history?

In [29]:
len(df_cast[(df_cast['year'] == 1996) & (df_cast['title'] == 'Hamlet')])

26

### How many people have played an "Ophelia"?

In [30]:
len(df_cast[df_cast['character'] == 'Ophelia']['name'].unique())

115

### How many people have played a role called "The Dude"?

In [31]:
len(df_cast[df_cast['character'] == 'The Dude']['character'].unique())

1

### How many people have played a role called "The Stranger"?

In [32]:
len(df_cast[df_cast['character'] == 'The Stranger']['name'].unique())

202

### How many roles has Sidney Poitier played throughout his career?

In [33]:
len(df_cast[df_cast['name'] == 'Sidney Poitier'])

43

### How many roles has Judi Dench played?

In [34]:
len(df_cast[df_cast['name'] == 'Judi Dench'])

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [35]:
len(df_cast[(df_cast['character'] == 'supporting') & (df_cast['n'] == 2) & (df_cast['year'] == 1940) ])

0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [36]:
df_cast[(df_cast['year'] == 1940) & (df_cast['title'] == 'Cary Grant')].sort_values(by='year')

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### How many roles were available for actors in the 1950s?

In [37]:
len(df_cast[(df_cast['year'] == 1950)]['type'].unique())

2

### How many roles were available for actresses in the 1950s?

In [38]:
len(
    df_cast[
            (df_cast['year'] == 1950) & 
            (df_cast['type'] == 'actress')
        ]
)

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [40]:
len(df_cast[
        (df_cast['year'] == 1980) & 
        (df_cast['n'].isnull())
        ])

2411